import React, {FC} from 'react';
import './App.css';
import Vacation from "./component/Vacation";

const App:FC = () => {

    return (
        <div className={'classBasic'}>
            <Vacation name={'Занзібар'}
                      image={'https://joinup.ua/media/2015/10/Zanzibare-slajd-1.jpg'}
                      alt={'Занзібар'}
                      classNameH2={'h2Style'}>Занзібар - це цілий архіпелаг. Він складається з 75 островів. Три найбільших з них - Мафія, Пемба, Умбуджа (саме останній часто називають Занзібаром) і їх більш дрібні «побратими» розтягнулися вздовж східного узбережжя Африки. Архіпелаг розташовується якраз навпроти Танзанії, до якої і відноситься. При цьому частина територій в Індійському океані є автономними.
            </Vacation>
            <Vacation name={'Таіланд'}
                      image={'https://avatars.mds.yandex.net/get-vertis-journal/3934100/photo_2023-11-16_10-35-16.jpg_1701155407535/orig'}
                      alt={'Таіланд'}
                      classNameH2={'h2Style'}>Таїланд розташований в Південно-Східній Азії, на півостровах Індокитай і Малакка, із заходу омивається Андаманським морем, зі сходу Сіамською затокою Південнокитайського моря. Територія Таїланду витягнута з півночі на південь (відстань від самої північної точки до найпівденнішої точки — 1860 км). Завдяки центральному положенню в Південно-Східній Азії і найбільшою серед країн регіону протяжності з півночі на південь, Таїланд має найрізноманітніший в Південно-Східній Азії клімат, тому врожаї основних культур збираються кілька разів на рік, а туристичний сезон «перетікає» з одних кліматичних зон в інші, роблячи Таїланд одним з небагатьох в світі цілорічних туристичних центрів. Ліси займають 10 % території країни: на півночі тропічні листопадні, у більш вологих південних районах — вічнозелені тропічні.
            </Vacation>
            <Vacation name={'Єгипет'}
                      image={'https://st4.depositphotos.com/13913996/41423/i/450/depositphotos_414231682-stock-photo-egyptian-pyramids-at-sunset.jpg'}
                      alt={'Єгипет'}
                      classNameH2={'h2Style'}>Єгипет - країна, розташована на Синайському півострові в Північній Африці. Історично залишився його поділ на Верхній і Нижній Єгипет. У країні є вихід до двох морів: Середземного з півночі і Червоного зі сходу. Має багатющу історію: майже п'ять століть Єгипет входив до складу Османської імперії - могутньої держави, що наводила жах на сусідів. В кінці ХІХ століття Єгипет став протекторатом Великобританії, за що заплатив свою ціну, але вже на початку ХХ століття отримав незалежність.
            </Vacation>
        </div>
    );
}
export default App;